### pandas

### creating pandas using list

In [1]:
import pandas as pd

In [2]:
data =[
       [100,'thomas','mgr',1000],
       [200,'mary','pgmr',2000],
       [300,'kate','mgr',3000],
       [400,'patty','pgmr',4000],
       [500,'harry','HR',5000],
       [600,'zeesh','developer',150000]
    
    
      ]

In [3]:
e1 =pd.DataFrame(data)
e1

     0       1          2       3
0  100  thomas        mgr    1000
1  200    mary       pgmr    2000
2  300    kate        mgr    3000
3  400   patty       pgmr    4000
4  500   harry         HR    5000
5  600   zeesh  developer  150000

In [4]:
type(e1)

pandas.core.frame.DataFrame

In [5]:
e2 =pd.DataFrame(data, columns = ['eid','ename','job','salary'])

e2

   eid   ename        job  salary
0  100  thomas        mgr    1000
1  200    mary       pgmr    2000
2  300    kate        mgr    3000
3  400   patty       pgmr    4000
4  500   harry         HR    5000
5  600   zeesh  developer  150000

In [6]:
edf = pd.DataFrame(data, 
                   columns = ['eid','ename','job','salary'],
                    index = ['e1','e2','e3','e4','e5','e6'])
edf

    eid   ename        job  salary
e1  100  thomas        mgr    1000
e2  200    mary       pgmr    2000
e3  300    kate        mgr    3000
e4  400   patty       pgmr    4000
e5  500   harry         HR    5000
e6  600   zeesh  developer  150000

#### b using dictionary

In [7]:
edict = {
    'eid':[100,200,300],
    'ename':['zees','rashi' ,'suhail'],
    'esal':[1000000,40000,50000]
    
}
e3= pd.DataFrame(edict)
e3

   eid   ename     esal
0  100    zees  1000000
1  200   rashi    40000
2  300  suhail    50000

### load from extenal source

In [8]:
univ =pd.read_csv("F:/offline _ds/00_datasets/Universities.csv" )
univ

            Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0          Brown  1310     89      22       13     22704        94
1        CalTech  1415    100      25        6     63575        81
2            CMU  1260     62      59        9     25026        72
3       Columbia  1310     76      24       12     31510        88
4        Cornell  1280     83      33       13     21864        90
5      Dartmouth  1340     89      23       10     32162        95
6           Duke  1315     90      30       12     31585        95
7     Georgetown  1255     74      24       12     20126        92
8        Harvard  1400     91      14       11     39525        97
9   JohnsHopkins  1305     75      44        7     58691        87
10           MIT  1380     94      30       10     34870        91
11  Northwestern  1260     85      39       11     28052        89
12     NotreDame  1255     81      42       13     15122        94
13     PennState  1081     38      54       18     10185        80
14     Princeton  1375     91      14        8     30220        95
15        Purdue  1005     28      90       19      9066        69
16      Stanford  1360     90      20       12     36450        93
17      TexasA&M  1075     49      67       25      8704        67
18    UCBerkeley  1240     95      40       17     15140        78
19      UChicago  1290     75      50       13     38380        87
20     UMichigan  1180     65      68       16     15470        85
21         UPenn  1285     80      36       11     27553        90
22           UVA  1225     77      44       14     13349        92
23    UWisconsin  1085     40      69       15     11857        71
24          Yale  1375     95      19       11     43514        96

In [9]:
univ.shape

(25, 7)

In [10]:
univ.index

RangeIndex(start=0, stop=25, step=1)

In [9]:
udf =pd.read_csv("F:/offline _ds/00_datasets/Universities.csv", index_col='Univ')
udf

               SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Brown         1310     89      22       13     22704        94
CalTech       1415    100      25        6     63575        81
CMU           1260     62      59        9     25026        72
Columbia      1310     76      24       12     31510        88
Cornell       1280     83      33       13     21864        90
Dartmouth     1340     89      23       10     32162        95
Duke          1315     90      30       12     31585        95
Georgetown    1255     74      24       12     20126        92
Harvard       1400     91      14       11     39525        97
JohnsHopkins  1305     75      44        7     58691        87
MIT           1380     94      30       10     34870        91
Northwestern  1260     85      39       11     28052        89
NotreDame     1255     81      42       13     15122        94
PennState     1081     38      54       18     10185        80
Princeton     1375     91      14        8     30220        95
Purdue        1005     28      90       19      9066        69
Stanford      1360     90      20       12     36450        93
TexasA&M      1075     49      67       25      8704        67
UCBerkeley    1240     95      40       17     15140        78
UChicago      1290     75      50       13     38380        87
UMichigan     1180     65      68       16     15470        85
UPenn         1285     80      36       11     27553        90
UVA           1225     77      44       14     13349        92
UWisconsin    1085     40      69       15     11857        71
Yale          1375     95      19       11     43514        96

In [12]:
udf.head()

           SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Brown     1310     89      22       13     22704        94
CalTech   1415    100      25        6     63575        81
CMU       1260     62      59        9     25026        72
Columbia  1310     76      24       12     31510        88
Cornell   1280     83      33       13     21864        90

In [13]:
univ.head()

       Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0     Brown  1310     89      22       13     22704        94
1   CalTech  1415    100      25        6     63575        81
2       CMU  1260     62      59        9     25026        72
3  Columbia  1310     76      24       12     31510        88
4   Cornell  1280     83      33       13     21864        90

In [14]:
udf.head(3)

          SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Brown    1310     89      22       13     22704        94
CalTech  1415    100      25        6     63575        81
CMU      1260     62      59        9     25026        72

In [15]:
udf.tail()

             SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
UMichigan   1180     65      68       16     15470        85
UPenn       1285     80      36       11     27553        90
UVA         1225     77      44       14     13349        92
UWisconsin  1085     40      69       15     11857        71
Yale        1375     95      19       11     43514        96

In [16]:
udf.tail(3)

             SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
UVA         1225     77      44       14     13349        92
UWisconsin  1085     40      69       15     11857        71
Yale        1375     95      19       11     43514        96

In [17]:
udf.info() #imp method

<class 'pandas.core.frame.DataFrame'>
Index: 25 entries, Brown to Yale
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   SAT       25 non-null     int64
 1   Top10     25 non-null     int64
 2   Accept    25 non-null     int64
 3   SFRatio   25 non-null     int64
 4   Expenses  25 non-null     int64
 5   GradRate  25 non-null     int64
dtypes: int64(6)
memory usage: 1.4+ KB

In [18]:
edf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, e1 to e6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     6 non-null      int64
 1   ename   6 non-null      object
 2   job     6 non-null      object
 3   salary  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 240.0+ bytes

In [19]:
udf.describe()

               SAT       Top10     Accept   SFRatio      Expenses   GradRate
count    25.000000   25.000000  25.000000  25.00000     25.000000  25.000000
mean   1266.440000   76.480000  39.200000  12.72000  27388.000000  86.720000
std     108.359771   19.433905  19.727308   4.06735  14424.883165   9.057778
min    1005.000000   28.000000  14.000000   6.00000   8704.000000  67.000000
25%    1240.000000   74.000000  24.000000  11.00000  15140.000000  81.000000
50%    1285.000000   81.000000  36.000000  12.00000  27553.000000  90.000000
75%    1340.000000   90.000000  50.000000  14.00000  34870.000000  94.000000
max    1415.000000  100.000000  90.000000  25.00000  63575.000000  97.000000

### aces data from df

In [20]:
u1 = udf.head(10)
u1

               SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Brown         1310     89      22       13     22704        94
CalTech       1415    100      25        6     63575        81
CMU           1260     62      59        9     25026        72
Columbia      1310     76      24       12     31510        88
Cornell       1280     83      33       13     21864        90
Dartmouth     1340     89      23       10     32162        95
Duke          1315     90      30       12     31585        95
Georgetown    1255     74      24       12     20126        92
Harvard       1400     91      14       11     39525        97
JohnsHopkins  1305     75      44        7     58691        87

#### acess single rows

In [21]:
u1.loc['CMU', :]

SAT          1260
Top10          62
Accept         59
SFRatio         9
Expenses    25026
GradRate       72
Name: CMU, dtype: int64

In [22]:
u1.iloc[2, :]

SAT          1260
Top10          62
Accept         59
SFRatio         9
Expenses    25026
GradRate       72
Name: CMU, dtype: int64

In [23]:
u1.loc['CMU':'Duke',:]

            SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CMU        1260     62      59        9     25026        72
Columbia   1310     76      24       12     31510        88
Cornell    1280     83      33       13     21864        90
Dartmouth  1340     89      23       10     32162        95
Duke       1315     90      30       12     31585        95

In [24]:
# acess range of rows
u1.loc[['CMU','Duke'],:]

       SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CMU   1260     62      59        9     25026        72
Duke  1315     90      30       12     31585        95

In [25]:
u1.iloc[2:7,:]

            SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CMU        1260     62      59        9     25026        72
Columbia   1310     76      24       12     31510        88
Cornell    1280     83      33       13     21864        90
Dartmouth  1340     89      23       10     32162        95
Duke       1315     90      30       12     31585        95

In [26]:
u1.iloc[[1,7],:]

             SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CalTech     1415    100      25        6     63575        81
Georgetown  1255     74      24       12     20126        92

note :
#### excepyion you can leave out column  specification

In [27]:
u1.iloc[[1,7]]

             SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CalTech     1415    100      25        6     63575        81
Georgetown  1255     74      24       12     20126        92

#### acesss columns

In [28]:
u1

               SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Brown         1310     89      22       13     22704        94
CalTech       1415    100      25        6     63575        81
CMU           1260     62      59        9     25026        72
Columbia      1310     76      24       12     31510        88
Cornell       1280     83      33       13     21864        90
Dartmouth     1340     89      23       10     32162        95
Duke          1315     90      30       12     31585        95
Georgetown    1255     74      24       12     20126        92
Harvard       1400     91      14       11     39525        97
JohnsHopkins  1305     75      44        7     58691        87

#### acess single column

In [29]:
u1.loc[:,'Accept']

Univ
Brown           22
CalTech         25
CMU             59
Columbia        24
Cornell         33
Dartmouth       23
Duke            30
Georgetown      24
Harvard         14
JohnsHopkins    44
Name: Accept, dtype: int64

In [30]:
u1.iloc[:,2]

Univ
Brown           22
CalTech         25
CMU             59
Columbia        24
Cornell         33
Dartmouth       23
Duke            30
Georgetown      24
Harvard         14
JohnsHopkins    44
Name: Accept, dtype: int64

#### acess range columns

In [31]:
u1.iloc[:,1:4]

              Top10  Accept  SFRatio
Univ
Brown            89      22       13
CalTech         100      25        6
CMU              62      59        9
Columbia         76      24       12
Cornell          83      33       13
Dartmouth        89      23       10
Duke             90      30       12
Georgetown       74      24       12
Harvard          91      14       11
JohnsHopkins     75      44        7

In [32]:
u1.loc[:,'Top10':'SFRatio']

              Top10  Accept  SFRatio
Univ
Brown            89      22       13
CalTech         100      25        6
CMU              62      59        9
Columbia         76      24       12
Cornell          83      33       13
Dartmouth        89      23       10
Duke             90      30       12
Georgetown       74      24       12
Harvard          91      14       11
JohnsHopkins     75      44        7

#### acess random columns

In [33]:
u1.loc[:,['Top10','Expenses']]

              Top10  Expenses
Univ
Brown            89     22704
CalTech         100     63575
CMU              62     25026
Columbia         76     31510
Cornell          83     21864
Dartmouth        89     32162
Duke             90     31585
Georgetown       74     20126
Harvard          91     39525
JohnsHopkins     75     58691

In [34]:
u1.iloc[:,[2,3]]

              Accept  SFRatio
Univ
Brown             22       13
CalTech           25        6
CMU               59        9
Columbia          24       12
Cornell           33       13
Dartmouth         23       10
Duke              30       12
Georgetown        24       12
Harvard           14       11
JohnsHopkins      44        7

note :
#### exception you can leave loc while accessing single columns or random columns

In [35]:
# u1.loc[:,'Sat']
u1['SAT']

Univ
Brown           1310
CalTech         1415
CMU             1260
Columbia        1310
Cornell         1280
Dartmouth       1340
Duke            1315
Georgetown      1255
Harvard         1400
JohnsHopkins    1305
Name: SAT, dtype: int64

In [36]:
# u1.loc[:,['Sat',Expenses]]
u1[['Top10','Expenses']]

              Top10  Expenses
Univ
Brown            89     22704
CalTech         100     63575
CMU              62     25026
Columbia         76     31510
Cornell          83     21864
Dartmouth        89     32162
Duke             90     31585
Georgetown       74     20126
Harvard          91     39525
JohnsHopkins     75     58691

In [37]:
u1

               SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Brown         1310     89      22       13     22704        94
CalTech       1415    100      25        6     63575        81
CMU           1260     62      59        9     25026        72
Columbia      1310     76      24       12     31510        88
Cornell       1280     83      33       13     21864        90
Dartmouth     1340     89      23       10     32162        95
Duke          1315     90      30       12     31585        95
Georgetown    1255     74      24       12     20126        92
Harvard       1400     91      14       11     39525        97
JohnsHopkins  1305     75      44        7     58691        87

In [38]:
u1.loc['Columbia','Top10']

np.int64(76)

In [39]:
u1.iloc[3,1]

np.int64(76)

In [40]:
u1.loc['Columbia':'Duke','Top10':'SFRatio']

           Top10  Accept  SFRatio
Univ
Columbia      76      24       12
Cornell       83      33       13
Dartmouth     89      23       10
Duke          90      30       12

In [41]:
u1.iloc[3:7,1:4]

           Top10  Accept  SFRatio
Univ
Columbia      76      24       12
Cornell       83      33       13
Dartmouth     89      23       10
Duke          90      30       12

In [42]:
udf

               SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Brown         1310     89      22       13     22704        94
CalTech       1415    100      25        6     63575        81
CMU           1260     62      59        9     25026        72
Columbia      1310     76      24       12     31510        88
Cornell       1280     83      33       13     21864        90
Dartmouth     1340     89      23       10     32162        95
Duke          1315     90      30       12     31585        95
Georgetown    1255     74      24       12     20126        92
Harvard       1400     91      14       11     39525        97
JohnsHopkins  1305     75      44        7     58691        87
MIT           1380     94      30       10     34870        91
Northwestern  1260     85      39       11     28052        89
NotreDame     1255     81      42       13     15122        94
PennState     1081     38      54       18     10185        80
Princeton     1375     91      14        8     30220        95
Purdue        1005     28      90       19      9066        69
Stanford      1360     90      20       12     36450        93
TexasA&M      1075     49      67       25      8704        67
UCBerkeley    1240     95      40       17     15140        78
UChicago      1290     75      50       13     38380        87
UMichigan     1180     65      68       16     15470        85
UPenn         1285     80      36       11     27553        90
UVA           1225     77      44       14     13349        92
UWisconsin    1085     40      69       15     11857        71
Yale          1375     95      19       11     43514        96

In [43]:
udf['Expenses']>30000

Univ
Brown           False
CalTech          True
CMU             False
Columbia         True
Cornell         False
Dartmouth        True
Duke             True
Georgetown      False
Harvard          True
JohnsHopkins     True
MIT              True
Northwestern    False
NotreDame       False
PennState       False
Princeton        True
Purdue          False
Stanford         True
TexasA&M        False
UCBerkeley      False
UChicago         True
UMichigan       False
UPenn           False
UVA             False
UWisconsin      False
Yale             True
Name: Expenses, dtype: bool

In [44]:
udf[udf['Expenses']>30000]

               SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CalTech       1415    100      25        6     63575        81
Columbia      1310     76      24       12     31510        88
Dartmouth     1340     89      23       10     32162        95
Duke          1315     90      30       12     31585        95
Harvard       1400     91      14       11     39525        97
JohnsHopkins  1305     75      44        7     58691        87
MIT           1380     94      30       10     34870        91
Princeton     1375     91      14        8     30220        95
Stanford      1360     90      20       12     36450        93
UChicago      1290     75      50       13     38380        87
Yale          1375     95      19       11     43514        96

In [45]:
udf[(udf['Expenses']>30000) & (udf['SAT']>1350)]

            SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CalTech    1415    100      25        6     63575        81
Harvard    1400     91      14       11     39525        97
MIT        1380     94      30       10     34870        91
Princeton  1375     91      14        8     30220        95
Stanford   1360     90      20       12     36450        93
Yale       1375     95      19       11     43514        96

## data cleaning

### handling null values

In [46]:
import numpy as np

In [47]:
dnull = [ [1,2,3,'M',7],
         [np.nan,5,6,np.nan,7],
         [8,np.nan,9,'F',10],
         [np.nan,np.nan,np.nan,'M',11] 
        ]

dframe = pd.DataFrame(dnull, columns=['a','b','c','d','e'])
dframe

     a    b    c    d   e
0  1.0  2.0  3.0    M   7
1  NaN  5.0  6.0  NaN   7
2  8.0  NaN  9.0    F  10
3  NaN  NaN  NaN    M  11

In [48]:
dframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      float64
 1   b       2 non-null      float64
 2   c       3 non-null      float64
 3   d       3 non-null      object
 4   e       4 non-null      int64
dtypes: float64(3), int64(1), object(1)
memory usage: 292.0+ bytes

In [49]:
dframe.isna()

       a      b      c      d      e
0  False  False  False  False  False
1   True  False  False   True  False
2  False   True  False  False  False
3   True   True   True  False  False

In [50]:
dframe.isna().sum()

a    2
b    2
c    1
d    1
e    0
dtype: int64

In [51]:
dframe['d'].mode()

0    M
Name: d, dtype: object

In [52]:
mode_d=dframe['d'].mode()[0]
mode_d

'M'

In [53]:

avg_a = dframe['a'].mean()
avg_b = dframe['b'].mean()
avg_c = dframe['c'].mean()

avg_a ,avg_b , avg_c

(np.float64(4.5), np.float64(3.5), np.float64(6.0))

In [54]:
dframe

     a    b    c    d   e
0  1.0  2.0  3.0    M   7
1  NaN  5.0  6.0  NaN   7
2  8.0  NaN  9.0    F  10
3  NaN  NaN  NaN    M  11

In [55]:
# dframes

In [56]:
dframe.fillna(
    {
        'a':avg_a ,
        'b':avg_b ,
        'c':avg_c,
        'd':mode_d
        
    },
    # inplace = true
    
)

     a    b    c  d   e
0  1.0  2.0  3.0  M   7
1  4.5  5.0  6.0  M   7
2  8.0  3.5  9.0  F  10
3  4.5  3.5  6.0  M  11

In [57]:
dframe.fillna(0)

     a    b    c  d   e
0  1.0  2.0  3.0  M   7
1  0.0  5.0  6.0  0   7
2  8.0  0.0  9.0  F  10
3  0.0  0.0  0.0  M  11

In [58]:
dframe.dropna(
    axis=0, #default
)

     a    b    c  d  e
0  1.0  2.0  3.0  M  7

In [59]:
dframe.dropna(
    axis=1, #default
)

    e
0   7
1   7
2  10
3  11

### b. handlimg dupilicates

In [60]:
ddup = pd.DataFrame({'col1':['A','A','B','B','B'],'col2':[2,2,2,3,3]})
ddup

  col1  col2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [61]:
ddup.drop_duplicates(
    inplace = True
)
ddup

  col1  col2
0    A     2
2    B     2
3    B     3

In [62]:
ddup

  col1  col2
0    A     2
2    B     2
3    B     3

### combine multiple dataframes

In [63]:
d1 = [[1,2,3],[4,5,6]]
df1 = pd.DataFrame(d1,columns=['a','b','c'])


d2 = [[10,20,30],[40,50,60]]
df2 = pd.DataFrame(d2,columns=['d','e','f'])


d3 = [[11,22,33],[44,55,66]]
df3 = pd.DataFrame(d3,columns=['a','b','c'])

In [64]:
df1

   a  b  c
0  1  2  3
1  4  5  6

In [65]:
df2

    d   e   f
0  10  20  30
1  40  50  60

In [66]:
df1.join(df2)

   a  b  c   d   e   f
0  1  2  3  10  20  30
1  4  5  6  40  50  60

### concat

In [67]:
df1

   a  b  c
0  1  2  3
1  4  5  6

In [68]:
df3

    a   b   c
0  11  22  33
1  44  55  66

In [69]:
pd.concat([df1,df3])

    a   b   c
0   1   2   3
1   4   5   6
0  11  22  33
1  44  55  66

In [70]:
d1 = {'movieid':[1,2,3,4,5],
     'title':['3 Idiots','2 States','Leo','RRR','Pushpa']}
movies = pd.DataFrame(d1)


d2 = {
    'memid':[1,2,3,4],
    'name':['Tom','Tim','Jon','Jim'],
    'movieid':[1,np.nan,3,5]
}
members=pd.DataFrame(d2)

In [71]:
movies

   movieid     title
0        1  3 Idiots
1        2  2 States
2        3       Leo
3        4       RRR
4        5    Pushpa

In [72]:
members

   memid name  movieid
0      1  Tom      1.0
1      2  Tim      NaN
2      3  Jon      3.0
3      4  Jim      5.0

In [73]:
pd.merge(movies,members,on='movieid', how ='inner') # show all movies that have been rented and the members who have ranted

   movieid     title  memid name
0        1  3 Idiots      1  Tom
1        3       Leo      3  Jon
2        5    Pushpa      4  Jim

In [74]:
pd.merge(movies,members,on='movieid', how ='left')

   movieid     title  memid name
0        1  3 Idiots    1.0  Tom
1        2  2 States    NaN  NaN
2        3       Leo    3.0  Jon
3        4       RRR    NaN  NaN
4        5    Pushpa    4.0  Jim

In [75]:
pd.merge(movies,members,on='movieid', how ='right')

   movieid     title  memid name
0      1.0  3 Idiots      1  Tom
1      NaN       NaN      2  Tim
2      3.0       Leo      3  Jon
3      5.0    Pushpa      4  Jim

In [76]:
pd.merge(movies,members,on='movieid', how ='outer')

   movieid     title  memid name
0      1.0  3 Idiots    1.0  Tom
1      2.0  2 States    NaN  NaN
2      3.0       Leo    3.0  Jon
3      4.0       RRR    NaN  NaN
4      5.0    Pushpa    4.0  Jim
5      NaN       NaN    2.0  Tim

### grouping records

In [77]:
edf

    eid   ename        job  salary
e1  100  thomas        mgr    1000
e2  200    mary       pgmr    2000
e3  300    kate        mgr    3000
e4  400   patty       pgmr    4000
e5  500   harry         HR    5000
e6  600   zeesh  developer  150000

In [78]:
edf ['job'].nunique()

4

In [79]:
edf ['job'].unique()

array(['mgr', 'pgmr', 'HR', 'developer'], dtype=object)

In [80]:
edf ['job'].value_counts()

job
mgr          2
pgmr         2
HR           1
developer    1
Name: count, dtype: int64

In [81]:
grp=edf.groupby ('job')
grp

In [82]:
for x in grp:
    print (x)
    print ('_'*50)

('HR',     eid  ename job  salary
e5  500  harry  HR    5000)
__________________________________________________
('developer',     eid  ename        job  salary
e6  600  zeesh  developer  150000)
__________________________________________________
('mgr',     eid   ename  job  salary
e1  100  thomas  mgr    1000
e3  300    kate  mgr    3000)
__________________________________________________
('pgmr',     eid  ename   job  salary
e2  200   mary  pgmr    2000
e4  400  patty  pgmr    4000)
__________________________________________________

In [83]:
for x,y in grp :
    print (x)
    print ('_'* 10)

HR
__________
developer
__________
mgr
__________
pgmr
__________

In [84]:
for x in grp:
    print (y)
    print ('_'*30)

    eid  ename   job  salary
e2  200   mary  pgmr    2000
e4  400  patty  pgmr    4000
______________________________
    eid  ename   job  salary
e2  200   mary  pgmr    2000
e4  400  patty  pgmr    4000
______________________________
    eid  ename   job  salary
e2  200   mary  pgmr    2000
e4  400  patty  pgmr    4000
______________________________
    eid  ename   job  salary
e2  200   mary  pgmr    2000
e4  400  patty  pgmr    4000
______________________________

In [85]:
grp.agg('mean', numeric_only =True)

             eid    salary
job
HR         500.0    5000.0
developer  600.0  150000.0
mgr        200.0    2000.0
pgmr       300.0    3000.0

In [86]:
grp.agg('min', numeric_only =True)

           eid  salary
job
HR         500    5000
developer  600  150000
mgr        100    1000
pgmr       200    2000

In [87]:
grp.agg('max', numeric_only =True)

           eid  salary
job
HR         500    5000
developer  600  150000
mgr        300    3000
pgmr       400    4000

In [89]:
sal = pd.read_csv("/Users/IT SOLUTION/Downloads/Salaries.csv")
sal.head()

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   20       20  Male  122400
2  AssocProf          A   20       17  Male   81285
3       Prof          B   23       23  Male  134778
4   AsstProf          B    1        0  Male   88000

In [90]:
sal.head()

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   20       20  Male  122400
2  AssocProf          A   20       17  Male   81285
3       Prof          B   23       23  Male  134778
4   AsstProf          B    1        0  Male   88000

In [ ]:
sal['rank'].nunique()

In [ ]:
sal['rank'].unique()

In [ ]:
sal ['rank'].value_counts()

In [ ]:
grp=sal.groupby ('rank')
grp

In [ ]:
for x in grp:
    print (x)
    print ('_'*50)

In [ ]:
grp.agg('mean', numeric_only =True)

In [ ]:
grp.agg('max', numeric_only =True)

In [ ]:
grp.agg('min', numeric_only =True)

In [ ]:
grp=sal.groupby ('sex')
grp

In [ ]:
for x in grp:
    print(x)

In [ ]:
grp.agg('min', numeric_only =True)

In [ ]:
grp.agg('mean', numeric_only =True)

### sorting

In [ ]:
u1

In [ ]:
u1.sort_values(by='Expenses')

In [ ]:
#  sort in decending orde
u1.sort_values(by='Expenses', ascending= False)

In [ ]:
u1.sort_index(ascending=False)

## sseries

In [ ]:
s1= u1['Top10']
type(s1)

In [ ]:
s1

In [ ]:
s1.head()

In [ ]:
s1.tail()

### apply() - function on a series

In [ ]:
def myfxn(x):
 
    if x > 35000:
        res='expesive'
    else:
        res='affortable'
    return res
        
myfxn(30000)

In [ ]:
u1['Expenses'].apply(myfxn)

In [ ]:
u1['Status']=u1['Expenses'].apply(myfxn)
u1

### lambda fxn -- anonymous ,one line fxn

In [ ]:
u1['Expenses'].apply (lambda x: 'Expenses' if x >35000 else 'affordable')

In [92]:
sal.head()

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   20       20  Male  122400
2  AssocProf          A   20       17  Male   81285
3       Prof          B   23       23  Male  134778
4   AsstProf          B    1        0  Male   88000

In [95]:
sal['rank'].nunique()

3

In [96]:
sal['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [99]:
sal['rank'].value_counts()

rank
Prof         26
AsstProf     16
AssocProf     9
Name: count, dtype: int64

In [111]:
gp=sal.groupby('rank')
gp

In [102]:
gp.agg('mean', numeric_only =True)

                 phd    service         salary
rank
AssocProf  14.888889  11.111111   93270.777778
AsstProf    5.312500   2.500000   82260.500000
Prof       26.307692  20.038462  125561.615385

In [103]:
gp.agg('min' , numeric_only =True)

           phd  service  salary
rank
AssocProf    9        6   71065
AsstProf     1        0   63100
Prof        12        0   90450

In [104]:
gp.agg('max' , numeric_only =True)

           phd  service  salary
rank
AssocProf   26       24  119800
AsstProf    11        6   97032
Prof        56       49  186960

In [105]:
gp=sal.groupby('sex')
gp

In [106]:
gp.agg('mean' , numeric_only =True)

              phd    service         salary
sex
Female  17.689655  11.965517  101788.172414
Male    17.727273  14.272727  112197.727273